Revit 2027 API
PlasticVinyl.PlasticvinylColor Property
 The property labeled "Color" from the "PlasticVinyl" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string PlasticvinylColor { get; }
Public Shared ReadOnly Property PlasticvinylColor As String
	Get
public:
static property String^ PlasticvinylColor {
	String^ get ();
}
static member PlasticvinylColor : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
See Also
Reference
PlasticVinyl Class
Autodesk.Revit.DB.Visual Namespace